Repository: chiba233/SimpleZip
Catalog: SimpleZipIntentsExtension/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, th, zh_hans, zh_hant

# intent.compare.different
source: Archives differ: %1$@ added, %2$@ removed, %3$@ changed.
de: Archive unterscheiden sich: %1$@ hinzugefügt, %2$@ entfernt, %3$@ geändert.
es: Los archivos difieren: %1$@ añadidos, %2$@ eliminados, %3$@ cambiados.
fr: Les archives diffèrent : %1$@ ajoutées, %2$@ supprimées, %3$@ modifiées.
ja: アーカイブは異なります: 追加 %1$@、削除 %2$@、変更 %3$@。
ko: 아카이브가 다릅니다: 추가 %1$@, 제거 %2$@, 변경 %3$@.
ru: Архивы различаются: добавлено %1$@, удалено %2$@, изменено %3$@.
th: ไฟล์เก็บถาวรต่างกัน: เพิ่ม %1$@ ลบ %2$@ เปลี่ยน %3$@
zh_hans: 归档有差异:新增 %1$@、删除 %2$@、修改 %3$@。
zh_hant: 封存檔有差異：新增 %1$@、移除 %2$@、變更 %3$@。

# intent.compare.identical
source: Archives are identical (%@ entries).
de: Archive sind identisch (%@ Einträge).
es: Los archivos son idénticos (%@ entradas).
fr: Les archives sont identiques (%@ entrées).
ja: アーカイブは同一です（%@ 件の項目）。
ko: 아카이브가 동일합니다(항목 %@개).
ru: Архивы идентичны (%@ записей).
th: ไฟล์เก็บถาวรเหมือนกัน (%@ รายการ)
zh_hans: 两个归档完全一致(%@ 个条目)。
zh_hant: 兩個封存檔完全一致（%@ 個項目）。

# intent.error.badName
source: "%@" is not a valid archive name — use a plain file name without path separators.
de: "%@" ist kein gültiger Archivname - verwenden Sie einen einfachen Dateinamen ohne Pfadtrenner.
es: "%@" no es un nombre de archivo válido; usa un nombre de archivo simple sin separadores de ruta.
fr: « %@ » n’est pas un nom d’archive valide ; utilisez un simple nom de fichier sans séparateur de chemin.
ja: 「%@」は有効なアーカイブ名ではありません。パス区切り文字を含まない単純なファイル名を使用してください。
ko: 「%@」은(는) 올바른 아카이브 이름이 아닙니다. 경로 구분자가 없는 단순한 파일 이름을 사용하세요.
ru: «%@» не является допустимым именем архива — используйте простое имя файла без разделителей пути.
th: "%@" ไม่ใช่ชื่อไฟล์เก็บถาวรที่ถูกต้อง โปรดใช้ชื่อไฟล์ธรรมดาที่ไม่มีตัวคั่นเส้นทาง
zh_hans: 「%@」不是有效的归档名——请用不含路径分隔符的纯文件名。
zh_hant: 「%@」不是有效的歸檔名稱，請使用不含路徑分隔符的純檔名。

# intent.error.destinationNotFolder
source: The extraction destination must be a folder.
de: Das Entpackungsziel muss ein Ordner sein.
es: El destino de extracción debe ser una carpeta.
fr: La destination d'extraction doit être un dossier.
ja: 展開先はフォルダである必要があります。
ko: 추출 대상은 폴더여야 합니다.
ru: Назначение для извлечения должно быть папкой.
th: ปลายทางการแตกไฟล์ต้องเป็นโฟลเดอร์
zh_hans: 解压目标必须是一个文件夹。
zh_hant: 解壓縮目標必須是一個資料夾。

# intent.error.missingFile
source: No such file: %@
de: Datei nicht gefunden: %@
es: No existe el archivo: %@
fr: Fichier introuvable : %@
ja: ファイルがありません: %@
ko: 파일이 없습니다: %@
ru: Файл не найден: %@
th: ไม่มีไฟล์นี้: %@
zh_hans: 文件不存在：%@
zh_hant: 檔案不存在：%@

# intent.error.mixedFolders
source: All inputs must live in the same folder.
de: Alle Eingaben müssen im selben Ordner liegen.
es: Todas las entradas deben estar en la misma carpeta.
fr: Toutes les entrées doivent se trouver dans le même dossier.
ja: すべての入力は同じフォルダ内にある必要があります。
ko: 모든 입력은 같은 폴더에 있어야 합니다.
ru: Все входные файлы должны находиться в одной папке.
th: อินพุตทั้งหมดต้องอยู่ในโฟลเดอร์เดียวกัน
zh_hans: 所有输入必须位于同一文件夹。
zh_hant: 所有輸入必須位於同一資料夾。

# intent.error.noFileURL
source: %@ has no file on disk — pass real files, not in-memory data.
de: %@ hat keine Datei auf der Festplatte - übergeben Sie echte Dateien, keine Daten im Speicher.
es: %@ no tiene archivo en el disco; pasa archivos reales, no datos en memoria.
fr: %@ n’a pas de fichier sur le disque ; fournissez de vrais fichiers, pas des données en mémoire.
ja: %@ にはディスク上のファイルがありません。メモリ内データではなく実ファイルを渡してください。
ko: %@은(는) 디스크의 파일이 아닙니다. 메모리 데이터가 아니라 실제 파일을 전달하세요.
ru: У %@ нет файла на диске — передайте настоящие файлы, а не данные в памяти.
th: %@ ไม่มีไฟล์บนดิสก์ โปรดส่งไฟล์จริง ไม่ใช่ข้อมูลในหน่วยความจำ
zh_hans: %@ 没有磁盘文件——请传真实文件，而不是内存数据。
zh_hant: %@ 沒有磁碟檔案，請傳入真實檔案，而不是記憶體資料。

# intent.error.noInput
source: No files were provided.
de: Es wurden keine Dateien übergeben.
es: No se proporcionaron archivos.
fr: Aucun fichier fourni.
ja: ファイルが指定されていません。
ko: 제공된 파일이 없습니다.
ru: Файлы не переданы.
th: ไม่ได้ระบุไฟล์
zh_hans: 没有提供任何文件。
zh_hant: 沒有提供任何檔案。

# intent.error.signedContainerUnsupported
source: Signed containers (.siz / .szs) aren't supported in Shortcuts. Open the file in SimpleZip instead.
de: Signierte Container (.siz / .szs) werden in Kurzbefehlen nicht unterstützt. Öffne die Datei stattdessen in SimpleZip.
es: Los contenedores firmados (.siz / .szs) no se admiten en Atajos. Ábrelos en SimpleZip.
fr: Les conteneurs signés (.siz / .szs) ne sont pas pris en charge dans Raccourcis. Ouvrez le fichier dans SimpleZip.
ja: 署名付きコンテナ(.siz / .szs)はショートカットでは未対応です。SimpleZip で開いてください。
ko: 서명된 컨테이너(.siz / .szs)는 단축어에서 지원되지 않습니다. SimpleZip에서 여세요.
ru: Подписанные контейнеры (.siz / .szs) не поддерживаются в «Командах». Откройте файл в SimpleZip.
th: ทางลัดไม่รองรับคอนเทนเนอร์ที่ลงนาม (.siz / .szs) โปรดเปิดไฟล์ใน SimpleZip แทน
zh_hans: Shortcuts 不支持签名容器(.siz / .szs),请在 SimpleZip 中打开。
zh_hant: 捷徑不支援簽署容器(.siz / .szs),請改在 SimpleZip 中開啟。

# intent.inspect.clean
source: %1$@ has no suspicious paths — %2$@ file(s), %3$@, %4$@ macOS junk item(s).
de: %1$@ hat keine verdächtigen Pfade – %2$@ Datei(en), %3$@, %4$@ macOS-Müllobjekt(e).
es: %1$@ no tiene rutas sospechosas: %2$@ archivo(s), %3$@, %4$@ elemento(s) basura de macOS.
fr: %1$@ n’a aucun chemin suspect — %2$@ fichier(s), %3$@, %4$@ élément(s) indésirable(s) macOS.
ja: %1$@ に疑わしいパスはありません — %2$@ 個のファイル、%3$@、macOS の不要項目 %4$@ 個。
ko: %1$@에 의심스러운 경로가 없습니다 — 파일 %2$@개, %3$@, macOS 불필요 항목 %4$@개.
ru: В %1$@ нет подозрительных путей — файлов: %2$@, %3$@, мусорных объектов macOS: %4$@.
th: %1$@ ไม่มีเส้นทางที่น่าสงสัย — %2$@ ไฟล์, %3$@, รายการขยะ macOS %4$@ รายการ
zh_hans: %1$@ 没有可疑路径——%2$@ 个文件，%3$@，%4$@ 个 macOS 垃圾项。
zh_hant: %1$@ 沒有可疑路徑——%2$@ 個檔案，%3$@，%4$@ 個 macOS 垃圾項。

# intent.inspect.flagged
source: %1$@ has %2$@ flagged path(s) across %3$@ finding type(s) — %4$@ file(s), %5$@. Review before publishing.
de: %1$@ hat %2$@ markierte Pfad(e) in %3$@ Befundtyp(en) – %4$@ Datei(en), %5$@. Vor der Veröffentlichung prüfen.
es: %1$@ tiene %2$@ ruta(s) marcada(s) en %3$@ tipo(s) de hallazgo: %4$@ archivo(s), %5$@. Revisa antes de publicar.
fr: %1$@ comporte %2$@ chemin(s) signalé(s) sur %3$@ type(s) de problème — %4$@ fichier(s), %5$@. Vérifiez avant publication.
ja: %1$@ には %3$@ 種類の問題で %2$@ 個のパスが指摘されています — %4$@ 個のファイル、%5$@。公開前に確認してください。
ko: %1$@에 %3$@개 유형에 걸쳐 %2$@개의 표시된 경로가 있습니다 — 파일 %4$@개, %5$@. 게시 전에 검토하세요.
ru: В %1$@ отмечено путей: %2$@ по %3$@ типам — файлов: %4$@, %5$@. Проверьте перед публикацией.
th: %1$@ มีเส้นทางที่ถูกทำเครื่องหมาย %2$@ รายการใน %3$@ ประเภท — %4$@ ไฟล์, %5$@ ตรวจสอบก่อนเผยแพร่
zh_hans: %1$@ 有 %2$@ 个被标记的路径（%3$@ 类问题）——%4$@ 个文件，%5$@。发布前请复核。
zh_hant: %1$@ 有 %2$@ 個被標記的路徑（%3$@ 類問題）——%4$@ 個檔案，%5$@。發佈前請複查。

# intent.reproduce.formatUnsupported
source: Reproducibility check supports only zip and 7z archives.
de: Die Reproduzierbarkeitsprüfung unterstützt nur ZIP- und 7z-Archive.
es: La comprobación de reproducibilidad solo admite archivos zip y 7z.
fr: La vérification de reproductibilité ne prend en charge que les archives zip et 7z.
ja: 再現性チェックは zip と 7z のアーカイブのみ対応しています。
ko: 재현성 검사는 zip 및 7z 아카이브만 지원합니다.
ru: Проверка воспроизводимости поддерживает только архивы zip и 7z.
th: การตรวจสอบการทำซ้ำรองรับเฉพาะไฟล์ zip และ 7z เท่านั้น
zh_hans: 可复现检查仅支持 zip 和 7z 归档。
zh_hant: 可重現檢查僅支援 zip 與 7z 歸檔。

# intent.search.emptyQuery
source: Enter something to search for.
de: Bitte einen Suchbegriff eingeben.
es: Introduce algo que buscar.
fr: Saisissez un terme à rechercher.
ja: 検索する内容を入力してください。
ko: 검색할 내용을 입력하세요.
ru: Введите текст для поиска.
th: ป้อนสิ่งที่ต้องการค้นหา
zh_hans: 请输入要搜索的内容。
zh_hant: 請輸入要搜尋的內容。

# intent.search.none
source: No entries in %1$@ match "%2$@".
de: Keine Einträge in %1$@ entsprechen „%2$@“.
es: Ninguna entrada de %1$@ coincide con «%2$@».
fr: Aucune entrée de %1$@ ne correspond à « %2$@ ».
ja: %1$@ に「%2$@」に一致する項目はありません。
ko: %1$@에 "%2$@"과(와) 일치하는 항목이 없습니다.
ru: В %1$@ нет записей, соответствующих «%2$@».
th: ไม่มีรายการใน %1$@ ที่ตรงกับ "%2$@"
zh_hans: %1$@ 中没有条目匹配「%2$@」。
zh_hant: %1$@ 中沒有項目符合「%2$@」。

# intent.search.results
source: %1$@ entries in %2$@ match "%3$@".
de: %1$@ Einträge in %2$@ entsprechen „%3$@“.
es: %1$@ entradas de %2$@ coinciden con «%3$@».
fr: %1$@ entrées de %2$@ correspondent à « %3$@ ».
ja: %2$@ の %1$@ 件の項目が「%3$@」に一致します。
ko: %2$@의 %1$@개 항목이 "%3$@"과(와) 일치합니다.
ru: %1$@ записей в %2$@ соответствуют «%3$@».
th: %1$@ รายการใน %2$@ ตรงกับ "%3$@"
zh_hans: %2$@ 中有 %1$@ 个条目匹配「%3$@」。
zh_hant: %2$@ 中有 %1$@ 個項目符合「%3$@」。

# intent.test.allPassed
source: All %@ archive(s) passed.
de: Alle %@ Archiv(e) bestanden.
es: Todos los %@ archivo(s) pasaron.
fr: Toutes les %@ archive(s) ont réussi.
ja: %@ 個のアーカイブはすべて合格しました。
ko: %@개 아카이브가 모두 통과했습니다.
ru: Все архивы прошли проверку: %@.
th: ไฟล์เก็บถาวร %@ รายการผ่านทั้งหมด
zh_hans: 全部 %@ 个归档测试通过。
zh_hant: 全部 %@ 個歸檔測試通過。

# intent.test.failures
source: %1$@ archive(s) failed: %2$@
de: %1$@ Archiv(e) fehlgeschlagen: %2$@
es: %1$@ archivo(s) fallaron: %2$@
fr: %1$@ archive(s) en échec : %2$@
ja: %1$@ 個のアーカイブが失敗しました: %2$@
ko: %1$@개 아카이브 실패: %2$@
ru: Архивов с ошибкой: %1$@ %2$@
th: ไฟล์เก็บถาวรล้มเหลว %1$@ รายการ: %2$@
zh_hans: %1$@ 个归档未通过： %2$@
zh_hant: %1$@ 個歸檔未通過： %2$@

# intent.verify.allPassed
source: All %@ checksum entries verified.
de: Alle %@ Prüfsummeneinträge wurden verifiziert.
es: Las %@ entradas de suma se verificaron.
fr: Les %@ entrées de sommes ont été vérifiées.
ja: %@ 件のチェックサム項目をすべて検証しました。
ko: 체크섬 항목 %@개가 모두 검증되었습니다.
ru: Все %@ записей контрольных сумм проверены.
th: ตรวจสอบรายการเช็กซัม %@ รายการทั้งหมดแล้ว
zh_hans: 全部 %@ 条校验条目通过。
zh_hant: 全部 %@ 條校驗項目已驗證。

# intent.verify.failures
source: %1$@ entries failed: %2$@
de: %1$@ Einträge fehlgeschlagen: %2$@
es: %1$@ entradas fallaron: %2$@
fr: %1$@ entrées ont échoué : %2$@
ja: %1$@ 件の項目が失敗: %2$@
ko: 항목 %1$@개 실패: %2$@
ru: %1$@ записей завершились ошибкой: %2$@
th: รายการล้มเหลว %1$@ รายการ: %2$@
zh_hans: %1$@ 条失败:%2$@
zh_hant: %1$@ 條失敗：%2$@

source: Packs a folder twice with reproducible settings and returns true when the two archives are byte-for-byte identical. Only zip and 7z are supported.
de: Packt einen Ordner zweimal mit reproduzierbaren Einstellungen und gibt „wahr“ zurück, wenn beide Archive Byte für Byte identisch sind. Nur ZIP und 7z werden unterstützt.
es: Empaqueta una carpeta dos veces con ajustes reproducibles y devuelve verdadero si los dos archivos son idénticos byte a byte. Solo se admiten zip y 7z.
fr: Empaquette un dossier deux fois avec des réglages reproductibles et renvoie vrai si les deux archives sont identiques octet pour octet. Seuls zip et 7z sont pris en charge.
ja: フォルダを再現可能な設定で2回パッケージし、2つのアーカイブがバイト単位で同一なら true を返します。対応は zip と 7z のみです。
ko: 폴더를 재현 가능한 설정으로 두 번 패킹하여 두 아카이브가 바이트 단위로 동일하면 true를 반환합니다. zip과 7z만 지원합니다.
ru: Дважды упаковывает папку с воспроизводимыми настройками и возвращает true, если оба архива побайтово идентичны. Поддерживаются только zip и 7z.
th: แพ็กโฟลเดอร์สองครั้งด้วยการตั้งค่าแบบทำซ้ำได้ และคืนค่า true เมื่อไฟล์บีบอัดทั้งสองเหมือนกันทุกไบต์ รองรับเฉพาะ zip และ 7z
zh_hans: 用可复现设置把文件夹打包两次,两个归档逐字节一致时返回真。仅支持 zip 和 7z。
zh_hant: 用可重現設定把資料夾打包兩次,兩個歸檔逐位元組一致時回傳真。僅支援 zip 與 7z。

source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
ru: Пароль
th: รหัสผ่าน
zh_hans: 密码
zh_hant: 密碼

source: Query
de: Suchanfrage
es: Consulta
fr: Requête
ja: クエリ
ko: 검색어
ru: Запрос
th: คำค้นหา
zh_hans: 查询
zh_hant: 查詢

source: Quick Verify Release Group
de: Release-Gruppe schnell prüfen
es: Verificación rápida del grupo de publicación
fr: Vérification rapide du groupe de publication
ja: リリース一式をすばやく確認
ko: 릴리스 그룹 빠른 확인
ru: Быстрая проверка группы релиза
th: ตรวจชุดรีลีสอย่างเร็ว
zh_hans: 快速核对发布组
zh_hant: 快速核對發佈組

source: Quick-verify the release group in ${folder}
de: Release-Gruppe in ${folder} schnell prüfen
es: Verificar rápidamente el grupo de publicación en ${folder}
fr: Vérifier rapidement le groupe de publication dans ${folder}
ja: ${folder} 内のリリース一式をすばやく確認
ko: ${folder}의 릴리스 그룹 빠른 확인
ru: Быстро проверить группу релиза в ${folder}
th: ตรวจชุดรีลีสใน ${folder} อย่างเร็ว
zh_hans: 快速核对 ${folder} 中的发布组
zh_hant: 快速核對 ${folder} 中的發佈組

source: Rescue ${archive}
de: ${archive} retten
es: Rescatar ${archive}
fr: Récupérer ${archive}
ja: ${archive} を救出
ko: ${archive} 복구
ru: Восстановить ${archive}
th: กู้ ${archive}
zh_hans: 救援 ${archive}
zh_hant: 救援 ${archive}

source: Rescue a damaged archive with ${applicationName}
de: Beschädigtes Archiv mit ${applicationName} retten
es: Rescatar un archivo dañado con ${applicationName}
fr: Récupérer une archive endommagée avec ${applicationName}
ja: ${applicationName} で破損したアーカイブを救出
ko: ${applicationName}으로 손상된 아카이브 복구
ru: Восстановить повреждённый архив в ${applicationName}
th: กู้ไฟล์บีบอัดที่เสียหายด้วย ${applicationName}
zh_hans: 用 ${applicationName} 救援损坏的归档
zh_hant: 用 ${applicationName} 救援損壞的壓縮檔

source: Rescue Damaged Archive
de: Beschädigtes Archiv retten
es: Rescatar archivo dañado
fr: Récupérer une archive endommagée
ja: 破損アーカイブを救出
ko: 손상된 아카이브 복구
ru: Восстановить повреждённый архив
th: กู้ไฟล์บีบอัดที่เสียหาย
zh_hans: 救援损坏的归档
zh_hant: 救援損壞的歸檔

source: Returns a disk-usage summary for an archive: original vs packed size, compression ratio, macOS junk and the largest file.
de: Liefert eine Speicherübersicht für ein Archiv: Originalgröße vs. gepackt, Kompressionsrate, macOS-Müll und die größte Datei.
es: Devuelve un resumen del uso de espacio de un archivo: tamaño original frente a comprimido, ratio de compresión, basura de macOS y el archivo más grande.
fr: Renvoie un résumé de l’occupation d’une archive : taille originale vs compressée, taux de compression, fichiers indésirables macOS et le plus gros fichier.
ja: アーカイブの容量サマリーを返します:元のサイズと圧縮後サイズ、圧縮率、macOSのゴミ、最大ファイル。
ko: 아카이브의 용량 요약을 반환합니다: 원본 대 압축 크기, 압축률, macOS 불필요 파일, 가장 큰 파일.
ru: Возвращает сводку по занимаемому месту в архиве: исходный и упакованный размер, степень сжатия, мусор macOS и самый большой файл.
th: คืนค่าสรุปการใช้พื้นที่ของไฟล์บีบอัด: ขนาดต้นฉบับเทียบกับขนาดที่บีบอัด อัตราการบีบอัด ขยะ macOS และไฟล์ที่ใหญ่ที่สุด
zh_hans: 返回归档的体积占用摘要:原始大小与压缩后大小、压缩率、macOS 垃圾,以及最大的文件。
zh_hant: 回傳歸檔的空間佔用摘要:原始大小與壓縮後大小、壓縮率、macOS 垃圾,以及最大的檔案。

source: Runs an integrity test across several archives and returns true only when every archive passes.
de: Führt einen Integritätstest über mehrere Archive aus und gibt nur dann „wahr“ zurück, wenn alle bestehen.
es: Ejecuta una prueba de integridad en varios archivos y devuelve verdadero solo cuando todos la superan.
fr: Effectue un test d’intégrité sur plusieurs archives et renvoie vrai uniquement si toutes réussissent.
ja: 複数のアーカイブに整合性テストを実行し、すべて合格した場合のみ true を返します。
ko: 여러 아카이브에 무결성 검사를 실행하고 모두 통과할 때만 true를 반환합니다.
ru: Запускает проверку целостности нескольких архивов и возвращает true, только если проходят все.
th: ทดสอบความสมบูรณ์ของไฟล์บีบอัดหลายไฟล์ และคืนค่า true เฉพาะเมื่อผ่านทุกไฟล์
zh_hans: 对多个归档逐个做完整性测试,只有全部通过才返回真。
zh_hant: 對多個歸檔逐一做完整性測試,只有全部通過才回傳真。

source: Runs SimpleZip's integrity test on archives and reports which ones fail. Provide a password for encrypted archives, or you'll be prompted when one is needed.
de: Führt SimpleZips Integritätstest für Archive aus und meldet, welche fehlschlagen. Gib für verschlüsselte Archive ein Passwort an – andernfalls wirst du bei Bedarf danach gefragt.
es: Ejecuta la prueba de integridad de SimpleZip en los archivos comprimidos e indica cuáles fallan. Indica una contraseña para los archivos cifrados; si hace falta, se te pedirá.
fr: Lance le test d'intégrité de SimpleZip sur les archives et indique celles qui échouent. Fournissez un mot de passe pour les archives chiffrées, sinon il vous sera demandé si nécessaire.
ja: アーカイブに対して SimpleZip の整合性テストを実行し、失敗したものを報告します。暗号化アーカイブにはパスワードを入力してください。必要なときは入力を求められます。
ko: 아카이브에 SimpleZip의 무결성 테스트를 실행하고 실패한 항목을 보고합니다. 암호화된 아카이브에는 암호를 입력하세요. 필요하면 입력을 요청합니다.
ru: Запускает проверку целостности SimpleZip для архивов и сообщает, какие из них не прошли. Укажите пароль для зашифрованных архивов — при необходимости его запросят.
th: เรียกใช้การทดสอบความสมบูรณ์ของ SimpleZip กับไฟล์บีบอัดและรายงานว่าไฟล์ใดไม่ผ่าน ระบุรหัสผ่านสำหรับไฟล์ที่เข้ารหัส หรือระบบจะถามเมื่อจำเป็น
zh_hans: 对归档运行 SimpleZip 的完整性测试,并报告哪些未通过。加密归档请填写密码,需要时也会提示你输入。
zh_hant: 對壓縮檔執行 SimpleZip 的完整性測試,並回報哪些未通過。加密壓縮檔請填寫密碼,需要時也會提示你輸入。

source: Search ${archive} for ${query}
de: ${archive} nach ${query} durchsuchen
es: Buscar ${query} en ${archive}
fr: Rechercher ${query} dans ${archive}
ja: ${archive} 内で ${query} を検索
ko: ${archive}에서 ${query} 검색
ru: Найти ${query} в ${archive}
th: ค้นหา ${query} ใน ${archive}
zh_hans: 在 ${archive} 中搜索 ${query}
zh_hant: 在 ${archive} 中搜尋 ${query}

source: Search an archive with ${applicationName}
de: Ein Archiv mit ${applicationName} durchsuchen
es: Buscar en un archivo con ${applicationName}
fr: Rechercher dans une archive avec ${applicationName}
ja: ${applicationName} でアーカイブを検索
ko: ${applicationName}(으)로 아카이브 검색
ru: Искать в архиве с помощью ${applicationName}
th: ค้นหาในไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 搜索归档
zh_hant: 用 ${applicationName} 搜尋歸檔

source: Search Archive Contents
de: Archivinhalt durchsuchen
es: Buscar en el contenido del archivo
fr: Rechercher dans l’archive
ja: アーカイブ内を検索
ko: 아카이브 내용 검색
ru: Поиск в архиве
th: ค้นหาเนื้อหาไฟล์เก็บถาวร
zh_hans: 搜索归档内容
zh_hant: 搜尋歸檔內容

source: Search archive contents with ${applicationName}
de: Archivinhalt mit ${applicationName} durchsuchen
es: Buscar en el contenido de un archivo con ${applicationName}
fr: Rechercher dans le contenu d’une archive avec ${applicationName}
ja: ${applicationName} でアーカイブ内を検索
ko: ${applicationName}(으)로 아카이브 내용 검색
ru: Искать содержимое архива с помощью ${applicationName}
th: ค้นหาเนื้อหาไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 搜索归档内容
zh_hant: 用 ${applicationName} 搜尋歸檔內容

source: Second Archive
de: Zweites Archiv
es: Segundo archivo
fr: Seconde archive
ja: 2つ目のアーカイブ
ko: 두 번째 아카이브
ru: Второй архив
th: ไฟล์เก็บถาวรที่สอง
zh_hans: 第二个归档
zh_hant: 第二個歸檔

source: Test ${archives}
de: ${archives} testen
es: Probar ${archives}
fr: Tester ${archives}
ja: ${archives} をテスト
ko: ${archives} 테스트
ru: Проверить ${archives}
th: ทดสอบ ${archives}
zh_hans: 测试 ${archives}
zh_hant: 測試 ${archives}

source: Test an archive with ${applicationName}
de: Ein Archiv mit ${applicationName} testen
es: Probar un archivo con ${applicationName}
fr: Tester une archive avec ${applicationName}
ja: ${applicationName} でアーカイブをテスト
ko: ${applicationName}(으)로 아카이브 테스트
ru: Проверить архив с помощью ${applicationName}
th: ทดสอบไฟล์เก็บถาวรด้วย ${applicationName}
zh_hans: 用 ${applicationName} 测试归档
zh_hant: 用 ${applicationName} 測試歸檔

source: Test Archive Integrity
de: Archivintegrität testen
es: Probar integridad del archivo
fr: Tester l’intégrité de l’archive
ja: アーカイブの整合性をテスト
ko: 아카이브 무결성 테스트
ru: Проверить целостность архива
th: ทดสอบความสมบูรณ์ของไฟล์เก็บถาวร
zh_hans: 测试归档完整性
zh_hant: 測試歸檔完整性

source: Verifies the files listed in checksum files (SHA256SUMS, .sha256, .md5, .sfv). Paths resolve relative to each checksum file; unsafe entries are rejected. Returns true when everything matches.
de: Überprüft die in Prüfsummendateien aufgeführten Dateien (SHA256SUMS, .sha256, .md5, .sfv). Pfade werden relativ zur jeweiligen Prüfsummendatei aufgelöst; unsichere Einträge werden abgelehnt. Gibt „wahr“ zurück, wenn alles übereinstimmt.
es: Verifica los archivos listados en archivos de sumas (SHA256SUMS, .sha256, .md5, .sfv). Las rutas se resuelven relativas a cada archivo de sumas; las entradas no seguras se rechazan. Devuelve verdadero cuando todo coincide.
fr: Vérifie les fichiers listés dans les fichiers de sommes (SHA256SUMS, .sha256, .md5, .sfv). Les chemins sont résolus par rapport à chaque fichier de sommes ; les entrées dangereuses sont rejetées. Renvoie vrai si tout correspond.
ja: チェックサムファイル(SHA256SUMS、.sha256、.md5、.sfv)に記載されたファイルを検証します。パスは各チェックサムファイルからの相対で解決し、危険なエントリは拒否します。すべて一致すれば true を返します。
ko: 체크섬 파일(SHA256SUMS, .sha256, .md5, .sfv)에 나열된 파일을 검증합니다. 경로는 각 체크섬 파일을 기준으로 해석하며 안전하지 않은 항목은 거부합니다. 모두 일치하면 true를 반환합니다.
ru: Проверяет файлы, перечисленные в файлах контрольных сумм (SHA256SUMS, .sha256, .md5, .sfv). Пути разрешаются относительно каждого файла сумм; небезопасные записи отклоняются. Возвращает true, если всё совпадает.
th: ตรวจสอบไฟล์ที่ระบุในไฟล์เช็คซัม (SHA256SUMS, .sha256, .md5, .sfv) เส้นทางอ้างอิงสัมพัทธ์กับไฟล์เช็คซัมแต่ละไฟล์ และปฏิเสธรายการที่ไม่ปลอดภัย คืนค่า true เมื่อทุกอย่างตรงกัน
zh_hans: 校验校验文件(SHA256SUMS、.sha256、.md5、.sfv)里列出的文件。路径相对各自的校验文件解析;不安全的条目会被拒绝。全部匹配时返回真。
zh_hant: 校驗校驗檔(SHA256SUMS、.sha256、.md5、.sfv)裡列出的檔案。路徑相對各自的校驗檔解析;不安全的條目會被拒絕。全部相符時回傳真。

source: Verify ${checksumFiles}
de: ${checksumFiles} verifizieren
es: Verificar ${checksumFiles}
fr: Vérifier ${checksumFiles}
ja: ${checksumFiles} を検証
ko: ${checksumFiles} 검증
ru: Проверить ${checksumFiles}
th: ตรวจสอบ ${checksumFiles}
zh_hans: 验证 ${checksumFiles}
zh_hant: 驗證 ${checksumFiles}

source: Verify a SHA256SUMS file with ${applicationName}
de: Eine SHA256SUMS-Datei mit ${applicationName} verifizieren
es: Verificar un archivo SHA256SUMS con ${applicationName}
fr: Vérifier un fichier SHA256SUMS avec ${applicationName}
ja: ${applicationName} で SHA256SUMS ファイルを検証
ko: ${applicationName}(으)로 SHA256SUMS 파일 검증
ru: Проверить файл SHA256SUMS с помощью ${applicationName}
th: ตรวจสอบไฟล์ SHA256SUMS ด้วย ${applicationName}
zh_hans: 用 ${applicationName} 验证 SHA256SUMS 文件
zh_hant: 用 ${applicationName} 驗證 SHA256SUMS 檔案

source: Verify Checksums
de: Prüfsummen verifizieren
es: Verificar sumas de comprobación
fr: Vérifier les sommes de contrôle
ja: チェックサムを検証
ko: 체크섬 검증
ru: Проверить контрольные суммы
th: ตรวจสอบเช็คซัม
zh_hans: 验证校验和
zh_hant: 驗證校驗和

source: Verify checksums with ${applicationName}
de: Prüfsummen mit ${applicationName} verifizieren
es: Verificar sumas de comprobación con ${applicationName}
fr: Vérifier des sommes de contrôle avec ${applicationName}
ja: ${applicationName} でチェックサムを検証
ko: ${applicationName}(으)로 체크섬 검증
ru: Проверить контрольные суммы с помощью ${applicationName}
th: ตรวจสอบเช็คซัมด้วย ${applicationName}
zh_hans: 用 ${applicationName} 验证校验和
zh_hant: 用 ${applicationName} 驗證校驗和

source: Format
es: Formato
ja: 形式
ko: 형식
ru: Формат
th: รูปแบบ
zh_hans: 格式
zh_hant: 格式
